app/views/postnotices/_form.html.erb

    <%= f.label :city %><br />
    <%= f.select :city_id, City.all.collect {|c| [c.name, c.id]}, :prompt => "Escolher uma cidade"%>
---
SELECT `cities`.* FROM `cities`

    <%= f.label :categorie %><br />
    <%= f.select :categorie_id, Categorie.all.collect {|c| [c.name, c.id]}, :prompt => "Escolher uma categoria" %>
---
SELECT `categories`.* FROM `categories`