app/views/postnotices/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`postnotice_id` = 1
---
<h2>Comentarios</h2>
<% @postnotice.comment.each do |comentario| %>