app/controllers/categories_controller.rb

  def index
    @categories = Categorie.all
---
SELECT `categories`.* FROM `categories`

  def show
    @category = Categorie.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @category = Categorie.new(params[:categorie])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 11 Oct 2013 03:32:20 UTC +00:00], ["name", "Politica"], ["updated_at", Fri, 11 Oct 2013 03:32:20 UTC +00:00]]

  def destroy
    @category = Categorie.find(params[:id])
    @category.destroy
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
DELETE FROM `categories` WHERE `categories`.`id` = 1