app/controllers/cities_controller.rb

SELECT `cities`.* FROM `cities`
---
  def index
    @cities = City.all

SELECT "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @city = City.find(params[:id])

INSERT INTO "cities" ("created_at", "name", "uf", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 11 Oct 2013 03:32:44 UTC +00:00], ["name", "Sorriso"], ["uf", "MT"], ["updated_at", Fri, 11 Oct 2013 03:32:44 UTC +00:00]]
---
  def create
    @city = City.new(params[:city])

    respond_to do |format|
      if @city.save