app/controllers/comments_controller.rb

INSERT INTO `comments` (`author`, `content`, `created_at`, `ip`, `postnotice_id`, `updated_at`) VALUES ('Jefferson', 'as', '2013-10-11 17:19:55', NULL, 1, '2013-10-11 17:19:55')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT `postnotices`.* FROM `postnotices` WHERE `postnotices`.`id` = 1 LIMIT 1
---
  def create
    @postnotices = Postnotice.find(params[:postnotice_id])