app/controllers/postnotices_controller.rb

SELECT `postnotices`.* FROM `postnotices`
---
  def index
    @postnotices = Postnotice.all

SELECT "postnotices".* FROM "postnotices" WHERE "postnotices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @postnotice = Postnotice.find(params[:id])

SELECT "postnotices".* FROM "postnotices" WHERE "postnotices"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @postnotice = Postnotice.find(params[:id])

INSERT INTO `postnotices` (`author`, `categorie_id`, `city_id`, `content`, `created_at`, `featured`, `image`, `title`, `updated_at`) VALUES ('Jefferson', 1, 1, 'asd', '2013-10-11 12:55:36', 0, 'topo_streaming.jpg', 'Segundo', '2013-10-11 12:55:36')
---
  def create
    @postnotice = Postnotice.new(params[:postnotice])

    respond_to do |format|
      if @postnotice.save

SELECT "postnotices".* FROM "postnotices" WHERE "postnotices"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "postnotices" SET "image" = 'Backgroundmenu.jpg', "featured" = 'f', "updated_at" = '2013-10-11 03:57:47.364043' WHERE "postnotices"."id" = 1
---
  def update
    @postnotice = Postnotice.find(params[:id])

    respond_to do |format|
      if @postnotice.update_attributes(params[:postnotice])

SELECT "postnotices".* FROM "postnotices" WHERE "postnotices"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "postnotices" WHERE "postnotices"."id" = ?  [["id", 1]]
---
  def destroy
    @postnotice = Postnotice.find(params[:id])
    @postnotice.destroy