app/controllers/site_controller.rb

  def index
  	@postnotices = Postnotice.all
---
SELECT `postnotices`.* FROM `postnotices`